## Использование Colab

#### Файл
https://drive.google.com/file/d/1BIMGEL4dM5sTICBDQriwfWgjpdQp3Yo9/view?usp=sharing
#### ДатаСет
https://www.kaggle.com/datasets/arashnic/hr-analytics-job-change-of-data-scientists

In [1]:
! gdown --id 1BIMGEL4dM5sTICBDQriwfWgjpdQp3Yo9

"gdown" ­Ґ пў«пҐвбп ў­гваҐ­­Ґ© Ё«Ё ў­Ґи­Ґ©
Є®¬ ­¤®©, ЁбЇ®«­пҐ¬®© Їа®Ја ¬¬®© Ё«Ё Ї ЄҐв­л¬ д ©«®¬.

In [2]:
! unzip /content/hr-analitics.zip

"unzip" ­Ґ пў«пҐвбп ў­гваҐ­­Ґ© Ё«Ё ў­Ґи­Ґ©
Є®¬ ­¤®©, ЁбЇ®«­пҐ¬®© Їа®Ја ¬¬®© Ё«Ё Ї ЄҐв­л¬ д ©«®¬.

## Чтение данных

In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('aug_train.csv')

In [5]:
df.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0

## Основные операции с ДатаФреймом

In [6]:
df.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0

In [7]:
df.tail()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14,NaN,NaN,1,42,1.0
19154,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14,NaN,NaN,4,52,1.0
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,4,44,0.0
19156,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,<1,500-999,Pvt Ltd,2,97,0.0
19157,23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2,NaN,NaN,1,127,0.0

In [8]:
df.city

0        city_103
1         city_40
2         city_21
3        city_115
4        city_162
           ...
19153    city_173
19154    city_103
19155    city_103
19156     city_65
19157     city_67
Name: city, Length: 19158, dtype: object

In [9]:
df['city']

0        city_103
1         city_40
2         city_21
3        city_115
4        city_162
           ...
19153    city_173
19154    city_103
19155    city_103
19156     city_65
19157     city_67
Name: city, Length: 19158, dtype: object

In [11]:
df[['city', 'city_development_index']]

           city  city_development_index
0      city_103                   0.920
1       city_40                   0.776
2       city_21                   0.624
3      city_115                   0.789
4      city_162                   0.767
...         ...                     ...
19153  city_173                   0.878
19154  city_103                   0.920
19155  city_103                   0.920
19156   city_65                   0.802
19157   city_67                   0.855

[19158 rows x 2 columns]

In [13]:
len(df), df.shape

(19158, (19158, 14))

In [14]:
df.columns

Index(['enrollee_id', 'city', 'city_development_index', 'gender',
       'relevent_experience', 'enrolled_university', 'education_level',
       'major_discipline', 'experience', 'company_size', 'company_type',
       'last_new_job', 'training_hours', 'target'],
      dtype='object')

In [15]:
df[['enrollee_id', 'city', 'city_development_index', 'gender',
       'relevent_experience', 'enrolled_university', 'education_level',
       'major_discipline',
       'last_new_job', 'training_hours', 'target']]

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,4,8,0.0
...,...,...,...,...,...,...,...,...,...,...,...
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,1,42,1.0
19154,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,4,52,1.0
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,4,44,0.0
19156,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,2,97,0.0
19157,23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,1,127,0.0

In [26]:
df['new_coll'] = 1

In [27]:
df.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target,new_coll
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0,1
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0,1
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0,1
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0,1
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0,1

In [20]:
df = df.drop(['new_col', 'new_call'], axis=1)

In [28]:
df.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target,new_coll
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0,1
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0,1
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0,1
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0,1
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0,1

In [29]:
df['new_coll2'] = df['city_development_index'] / df['training_hours']

In [30]:
df.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target,new_coll,new_coll2
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0,1,0.025556
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0,1,0.016511
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0,1,0.007518
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0,1,0.015173
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0,1,0.095875

##### assign - добавить вспомогательный столбец, не сохраняя в Датафрейме

In [32]:
df.assign(new_coll3=99)

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target,new_coll,new_coll2,new_coll3
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0,1,0.025556,99
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0,1,0.016511,99
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0,1,0.007518,99
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0,1,0.015173,99
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0,1,0.095875,99
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
19153,7386,city_173,0.878,Male,No relevent experience,no_enrollment,Graduate,Humanities,14,NaN,NaN,1,42,1.0,1,0.020905,99
19154,31398,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,14,NaN,NaN,4,52,1.0,1,0.017692,99
19155,24576,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,50-99,Pvt Ltd,4,44,0.0,1,0.020909,99
19156,5756,city_65,0.802,Male,Has relevent experience,no_enrollment,High School,NaN,<1,500-999,Pvt Ltd,2,97,0.0,1,0.008268,99
19157,23834,city_67,0.855,NaN,No relevent experience,no_enrollment,Primary School,NaN,2,NaN,NaN,1,127,0.0,1,0.006732,99

In [33]:
df.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target,new_coll,new_coll2
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0,1,0.025556
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0,1,0.016511
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0,1,0.007518
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0,1,0.015173
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0,1,0.095875

## Фильтрация и Ворнинги

In [34]:
df[df['city'] == 'city_40']

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target,new_coll,new_coll2
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0,1,0.016511
23,7041,city_40,0.776,Male,Has relevent experience,no_enrollment,Graduate,Humanities,<1,1000-4999,Pvt Ltd,1,65,0.0,1,0.011938
363,28229,city_40,0.776,Male,Has relevent experience,Part time course,Graduate,STEM,18,100-500,Funded Startup,>4,51,0.0,1,0.015216
461,18620,city_40,0.776,Male,Has relevent experience,Full time course,Graduate,STEM,14,1000-4999,Pvt Ltd,never,52,0.0,1,0.014923
827,1783,city_40,0.776,Male,Has relevent experience,no_enrollment,Masters,STEM,7,10000+,Pvt Ltd,1,56,0.0,1,0.013857
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18032,982,city_40,0.776,NaN,No relevent experience,Part time course,Graduate,STEM,3,NaN,NaN,NaN,34,1.0,1,0.022824
18061,11208,city_40,0.776,Male,No relevent experience,Full time course,Graduate,STEM,<1,NaN,NaN,1,127,1.0,1,0.006110
18191,157,city_40,0.776,Male,Has relevent experience,Full time course,Graduate,STEM,5,10000+,Pvt Ltd,never,42,0.0,1,0.018476
18650,26348,city_40,0.776,Male,Has relevent experience,no_enrollment,High School,NaN,13,50-99,Pvt Ltd,1,10,0.0,1,0.077600
19142,13750,city_40,0.776,Male,Has relevent experience,no_enrollment,NaN,NaN,5,10/49,Early Stage Startup,1,26,0.0,1,0.029846

In [38]:
df[(df['city'] == 'city_40') & (df['gender'] == 'Female')]

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target,new_coll,new_coll2
5625,18467,city_40,0.776,Female,Has relevent experience,no_enrollment,Masters,STEM,15,1000-4999,Pvt Ltd,2,25,0.0,1,0.031040
6385,11547,city_40,0.776,Female,Has relevent experience,no_enrollment,Graduate,STEM,2,10/49,Pvt Ltd,1,15,0.0,1,0.051733
8032,24409,city_40,0.776,Female,No relevent experience,no_enrollment,Masters,STEM,1,NaN,NaN,1,49,1.0,1,0.015837
8046,27349,city_40,0.776,Female,No relevent experience,no_enrollment,Masters,STEM,1,10/49,Pvt Ltd,never,19,1.0,1,0.040842
9923,6702,city_40,0.776,Female,No relevent experience,Full time course,Graduate,Other,1,100-500,NaN,1,34,0.0,1,0.022824
13871,17684,city_40,0.776,Female,Has relevent experience,no_enrollment,Graduate,STEM,5,50-99,Pvt Ltd,1,118,0.0,1,0.006576

In [37]:
df.query('city == "city_40" and gender == "Male"')

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target,new_coll,new_coll2
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0,1,0.016511
23,7041,city_40,0.776,Male,Has relevent experience,no_enrollment,Graduate,Humanities,<1,1000-4999,Pvt Ltd,1,65,0.0,1,0.011938
363,28229,city_40,0.776,Male,Has relevent experience,Part time course,Graduate,STEM,18,100-500,Funded Startup,>4,51,0.0,1,0.015216
461,18620,city_40,0.776,Male,Has relevent experience,Full time course,Graduate,STEM,14,1000-4999,Pvt Ltd,never,52,0.0,1,0.014923
827,1783,city_40,0.776,Male,Has relevent experience,no_enrollment,Masters,STEM,7,10000+,Pvt Ltd,1,56,0.0,1,0.013857
998,29671,city_40,0.776,Male,No relevent experience,Full time course,Graduate,STEM,9,NaN,NaN,1,50,0.0,1,0.015520
2916,21646,city_40,0.776,Male,No relevent experience,Full time course,High School,NaN,5,NaN,NaN,never,56,1.0,1,0.013857
3636,10085,city_40,0.776,Male,Has relevent experience,Full time course,Graduate,STEM,10,1000-4999,Pvt Ltd,1,104,0.0,1,0.007462
4251,2603,city_40,0.776,Male,Has relevent experience,no_enrollment,High School,NaN,3,50-99,Pvt Ltd,1,28,0.0,1,0.027714
4346,4051,city_40,0.776,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,1000-4999,Pvt Ltd,>4,20,0.0,1,0.038800
4526,11840,city_40,0.776,Male,Has relevent experience,Full time course,Graduate,STEM,3,50-99,Pvt Ltd,1,9,0.0,1,0.086222
4588,7010,city_40,0.776,Male,Has relevent experience,no_enrollment,Graduate,STEM,5,<10,Pvt Ltd,1,4,0.0,1,0.194000
5156,7556,city_40,0.776,Male,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,1,330,0.0,1,0.002352
6330,5389,city_40,0.776,Male,Has relevent experience,no_enrollment,High School,NaN,1,10/49,Pvt Ltd,1,89,0.0,1,0.008719
6483,484,city_40,0.776,Male,No relevent experience,Full time course,High School,NaN,3,NaN,Pvt Ltd,never,22,0.0,1,0.035273
6990,14681,city_40,0.776,Male,Has relevent experience,no_enrollment,High School,NaN,16,100-500,Funded Startup,>4,76,0.0,1,0.010211
7009,1221,city_40,0.776,Male,Has relevent experience,no_enrollment,Masters,STEM,10,1000-4999,Pvt Ltd,1,32,0.0,1,0.024250
8606,10244,city_40,0.776,Male,Has relevent experience,no_enrollment,Graduate,Other,4,<10,Pvt Ltd,1,108,0.0,1,0.007185
8661,3200,city_40,0.776,Male,Has relevent experience,no_enrollment,Graduate,Humanities,>20,NaN,NaN,4,29,0.0,1,0.026759
8847,27287,city_40,0.776,Male,Has relevent experience,no_enrollment,Masters,Other,10,<10,Pvt Ltd,2,35,0.0,1,0.022171
9390,33101,city_40,0.776,Male,Has relevent experience,no_enrollment,Graduate,STEM,10,500-999,Pvt Ltd,>4,32,0.0,1,0.024250
9658,17972,city_40,0.776,Male,Has relevent experience,no_enrollment,Masters,STEM,6,<10,Pvt Ltd,2,54,0.0,1,0.014370
10952,23316,city_40,0.776,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,10/49,Pvt Ltd,1,15,0.0,1,0.051733
11072,25420,city_40,0.776,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,>4,22,0.0,1,0.035273
11700,16999,city_40,0.776,Male,Has relevent experience,no_enrollment,Graduate,No Major,6,<10,Pvt Ltd,3,144,0.0,1,0.005389
12228,12801,city_40,0.776,Male,Has relevent experience,Part time course,Graduate,STEM,>20,100-500,Public Sector,>4,89,0.0,1,0.008719
12601,8663,city_40,0.776,Male,Has relevent experience,Part time course,Graduate,STEM,10,10/49,Pvt Ltd,>4,13,0.0,1,0.059692
12782,27144,city_40,0.776,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,<10,Pvt Ltd,1,58,0.0,1,0.013379
13385,9845,city_40,0.776,Male,Has relevent experience,no_enrollment,Masters,STEM,15,50-99,Pvt Ltd,>4,78,0.0,1,0.009949
13520,22956,city_40,0.776,Male,Has relevent experience,NaN,Graduate,STEM,5,50-99,NaN,1,98,0.0,1,0.007918
14231,1047,city_40,0.776,Male,Has relevent experience,no_enrollment,High School,NaN,19,NaN,NaN,1,72,0.0,1,0.010778
14462,8565,city_40,0.776,Male,Has relevent experience,no_enrollment,Masters,STEM,7,50-99,NaN,1,25,1.0,1,0.031040
15553,28032,city_40,0.776,Male,Has relevent experience,no_enrollment,Graduate,STEM,4,NaN,NaN,2,89,1.0,1,0.008719
16174,15617,city_40,0.776,Male,Has relevent experience,no_enrollment,Graduate,Humanities,11,10/49,Pvt Ltd,2,50,0.0,1,0.015520
17315,25444,city_40,0.776,Male,Has relevent experience,no_enrollment,Masters,STEM,10,100-500,Pvt Ltd,1,22,0.0,1,0.035273
17324,15257,city_40,0.776,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,4,90,0.0,1,0.008622
17761,31883,city_40,0.776,Male,Has relevent experience,Part time course,Graduate,STEM,5,50-99,Pvt Ltd,3,98,0.0,1,0.007918
17803,11634,city_40,0.776,Male,Has relevent experience,no_enrollment,Graduate,STEM,4,10/49,Pvt Ltd,1,61,0.0,1,0.012721
17849,12243,city_40,0.776,Male,No relevent experience,Full time course,Graduate,STEM,7,NaN,NaN,never,1,0.0,1,0.776000
18061,11208,city_40,0.776,Male,No relevent experience,Full time course,Graduate,STEM,<1,NaN,NaN,1,127,1.0,1,0.006110
18191,157,city_40,0.776,Male,Has relevent experience,Full time course,Graduate,STEM,5,10000+,Pvt Ltd,never,42,0.0,1,0.018476
18650,26348,city_40,0.776,Male,Has relevent experience,no_enrollment,High School,NaN,13,50-99,Pvt Ltd,1,10,0.0,1,0.077600
19142,13750,city_40,0.776,Male,Has relevent experience,no_enrollment,NaN,NaN,5,10/49,Early Stage Startup,1,26,0.0,1,0.029846

In [39]:
city_40_female = df[(df['city'] == 'city_40') & (df['gender'] == 'Female')]

In [40]:
city_40_female

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target,new_coll,new_coll2
5625,18467,city_40,0.776,Female,Has relevent experience,no_enrollment,Masters,STEM,15,1000-4999,Pvt Ltd,2,25,0.0,1,0.031040
6385,11547,city_40,0.776,Female,Has relevent experience,no_enrollment,Graduate,STEM,2,10/49,Pvt Ltd,1,15,0.0,1,0.051733
8032,24409,city_40,0.776,Female,No relevent experience,no_enrollment,Masters,STEM,1,NaN,NaN,1,49,1.0,1,0.015837
8046,27349,city_40,0.776,Female,No relevent experience,no_enrollment,Masters,STEM,1,10/49,Pvt Ltd,never,19,1.0,1,0.040842
9923,6702,city_40,0.776,Female,No relevent experience,Full time course,Graduate,Other,1,100-500,NaN,1,34,0.0,1,0.022824
13871,17684,city_40,0.776,Female,Has relevent experience,no_enrollment,Graduate,STEM,5,50-99,Pvt Ltd,1,118,0.0,1,0.006576

##### Данная строка вызывает ворнинг, т.к. не была создана копия ↓

In [41]:
city_40_female['new_coll3'] = 1

C:\Users\Zetis\AppData\Local\Temp\ipykernel_9508\2583420668.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  city_40_female['new_coll3'] = 1

In [43]:
city_40_female_1 = df[(df['city'] == 'city_40') & (df['gender'] == 'Female')].copy()

##### Теперь данння строчка ↓ не вызывает ворнинга, т.к. изменения были применены, к копии ДФ

In [44]:
city_40_female_1['new_coll4'] = 2